# DataFrame-Conditional Selection

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

Now we are going to set a seed. Seed will insure that every one will get same random number. Everyone means whose tutorial i am following.

In [3]:
np.random.seed(101)

Create Matrix For DataFrame. This is 5 by 4 Matrix.

In [4]:
Matrix = randn(5,4)

Create Row Label using python list.

In [5]:
rowLabel = ['Row-0','Row-1','Row-2','Row-3','Row-4']

Create Column Label using python list.

In [6]:
columnLabel = ['Column-0','Column-1','Column-2','Column-3']

Create a pandas DataFrame

In [7]:
dataFrame = pd.DataFrame(data=Matrix,index=rowLabel,columns=columnLabel)

In [8]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

# DataFrame-Single Condition

Pandas conditional selection is very similar to numpy's conditional selection. Say we want to know where in the dataFrame value is more than zero.

In [9]:
boolDataFrame = dataFrame > 0

In [10]:
boolDataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0      True      True      True      True
Row-1      True     False     False      True
Row-2     False      True      True     False
Row-3      True     False     False      True
Row-4      True      True      True      True

Now if we pass this boolean DataFrame as a argument to our orginal dataFrame. We will receive a datafram where data value is true. Where value is equal to false, we will get NaN.

In [11]:
dataFrame[boolDataFrame]

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118       NaN       NaN  0.605965
Row-2       NaN  0.740122  0.528813       NaN
Row-3  0.188695       NaN       NaN  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

We can also conditional select single column from DataFrame

In [12]:
boolColumn1 = dataFrame['Column-1'] > 0

In [13]:
boolColumn1

Row-0     True
Row-1    False
Row-2     True
Row-3    False
Row-4     True
Name: Column-1, dtype: bool

Now we can conditionally select from DataFrame where boolColumn1 value is true. Example:

In [14]:
dataFrame[boolColumn1]

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-4  0.190794  1.978757  2.605967  0.683509

See we did not get Row-1 and Row-3. As in boolColumn1 variable those rows are false.

###### Say we want to grab all of the rows in our DataFrame, where Column-3 is less than zero. We will do this exercise step by step. Lets visualize our dateFrame first.

In [15]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

Now find out the row where Column-3 has less than zero value.

In [18]:
dataFrame['Column-3'] < 0

Row-0    False
Row-1    False
Row-2     True
Row-3    False
Row-4    False
Name: Column-3, dtype: bool

So we have found that only Row-2 of Column-3 has less than zero value. Now we will finish our exercise in one step.

In [20]:
dataFrame[dataFrame['Column-3'] < 0]

       Column-0  Column-1  Column-2  Column-3
Row-2 -2.018168  0.740122  0.528813 -0.589001

###### So if we want to find out where more than zero.

In [21]:
resultedDataFrame = dataFrame[dataFrame['Column-3'] > 0]

In [22]:
resultedDataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

So now if we want to grab Column-3 from resultedDataFrame.

In [23]:
resultedDataFrame['Column-3']

Row-0    0.503826
Row-1    0.605965
Row-3    0.955057
Row-4    0.683509
Name: Column-3, dtype: float64

We can do all of those calculation in single line.

In [26]:
dataFrame[dataFrame['Column-3'] > 0]['Column-3']

Row-0    0.503826
Row-1    0.605965
Row-3    0.955057
Row-4    0.683509
Name: Column-3, dtype: float64

# DataFrame-Multiple Condition

Lets visualize our dataFrame first

In [27]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

###### Say we want to grab DataFrame where 'Column-3' > 0  and 'Column-1' >1

In [35]:
firstCondition = dataFrame['Column-3'] > 0

In [36]:
firstCondition

Row-0     True
Row-1     True
Row-2    False
Row-3     True
Row-4     True
Name: Column-3, dtype: bool

In [37]:
secondCondition = dataFrame['Column-1'] > 1

In [38]:
secondCondition

Row-0    False
Row-1    False
Row-2    False
Row-3    False
Row-4     True
Name: Column-1, dtype: bool

Now we will supply mutiple condition to grab data from DataFrame.

In [39]:
dataFrame[firstCondition and secondCondition]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

See we have gotten an error. Because python normal 'and' operator can not compare series of boolean value with other series of boolean value. Python's normal 'and' operator can only account single boolean at a time. Example

In [33]:
True and True

True

So if we want to compare series of boolean value than we have to use '&'. Same is true for 'or' operator. Instead of 'or' operator we will use '|'

In [40]:
dataFrame[firstCondition & secondCondition]

       Column-0  Column-1  Column-2  Column-3
Row-4  0.190794  1.978757  2.605967  0.683509

In [41]:
dataFrame[firstCondition | secondCondition]

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

We can do avobe calculation in single line. So we will save memory.

In [44]:
dataFrame[(dataFrame['Column-1'] > 1) & (dataFrame['Column-3'] > 0)]

       Column-0  Column-1  Column-2  Column-3
Row-4  0.190794  1.978757  2.605967  0.683509

In [45]:
dataFrame[(dataFrame['Column-1'] > 1) | (dataFrame['Column-3'] > 0)]

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

# DataFrame-Index

Here we will discus how to reset DataFrame index or set DataFrame index to be something else. Lets visualize our dataFrame.

In [46]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

### Reset To Default Index

In [47]:
dataFrame.reset_index()

   index  Column-0  Column-1  Column-2  Column-3
0  Row-0  2.706850  0.628133  0.907969  0.503826
1  Row-1  0.651118 -0.319318 -0.848077  0.605965
2  Row-2 -2.018168  0.740122  0.528813 -0.589001
3  Row-3  0.188695 -0.758872 -0.933237  0.955057
4  Row-4  0.190794  1.978757  2.605967  0.683509

This reset_index() does not occur inplace. If we wan to permanantly change the index, we will set inplace=true

In [48]:
dataFrame

       Column-0  Column-1  Column-2  Column-3
Row-0  2.706850  0.628133  0.907969  0.503826
Row-1  0.651118 -0.319318 -0.848077  0.605965
Row-2 -2.018168  0.740122  0.528813 -0.589001
Row-3  0.188695 -0.758872 -0.933237  0.955057
Row-4  0.190794  1.978757  2.605967  0.683509

### Set New Index

In [49]:
newIndex = 'CA NY WY OR CO'.split()

In [50]:
newIndex

['CA', 'NY', 'WY', 'OR', 'CO']

Instead of typing out every comma we have used above trick. As string default split() is on blank space. Using this trick we have gotten python list.

Now we will set those index as a new column value in our dataFrame.

In [51]:
dataFrame['States'] = newIndex

In [52]:
dataFrame

       Column-0  Column-1  Column-2  Column-3 States
Row-0  2.706850  0.628133  0.907969  0.503826     CA
Row-1  0.651118 -0.319318 -0.848077  0.605965     NY
Row-2 -2.018168  0.740122  0.528813 -0.589001     WY
Row-3  0.188695 -0.758872 -0.933237  0.955057     OR
Row-4  0.190794  1.978757  2.605967  0.683509     CO

Now we will set States as our index

In [53]:
dataFrame.set_index('States')

        Column-0  Column-1  Column-2  Column-3
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [54]:
dataFrame

       Column-0  Column-1  Column-2  Column-3 States
Row-0  2.706850  0.628133  0.907969  0.503826     CA
Row-1  0.651118 -0.319318 -0.848077  0.605965     NY
Row-2 -2.018168  0.740122  0.528813 -0.589001     WY
Row-3  0.188695 -0.758872 -0.933237  0.955057     OR
Row-4  0.190794  1.978757  2.605967  0.683509     CO

If we want to set this new index permanently we will set inplace=True